# Taps
tap "ethereum/ethereum"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "minio/stable"

# Brews
brew "python"
brew "ansible"
brew "bat"
brew "emacs"
brew "fzf"
brew "ghostscript"
brew "git"
brew "graphviz"
brew "imagemagick"
brew "jq"
brew "librsvg"
brew "mas"
brew "maven"
brew "sbt"
brew "telnet"
brew "terraform"
brew "ufraw"
brew "vim"
brew "ethereum/ethereum/ethereum"
brew "minio/stable/mc"

# Casks
cask "avast-security"
cask "balenaetcher"
cask "beamer"
cask "citrix-receiver"
cask "cyberduck"
cask "drawio"
cask "firefox"
cask "fritzing"
cask "google-chrome"
cask "iterm2"
cask "karabiner-elements"
cask "kindle"
cask "lulu"
cask "macpass"
cask "mongodb-compass"
cask "mplayerx"
cask "onyx"
cask "openttd"
cask "oversight"
cask "postman"
cask "slack"
cask "soundflower"
cask "spotify"
cask "steam"
cask "telegram"
cask "tunnelblick"
cask "vlc"
cask "vnc-viewer"
cask "whatsapp"

# Mac App Store
# Find name of an App by calling curl "http://itunes.apple.com/lookup?id=715768417" | jq -r ".results[0].trackName"
mas "Numbers", id: 409203825
mas "Airmail 3", id: 918858936
mas "Pages", id: 409201541
mas "Xcode", id: 497799835
mas "Keynote", id: 409183694
mas "iA Writer", id: 775737590
mas "NordVPN IKE", id: 1116599239
mas "MS Remote Desktop", id: 715768417
