# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "minio/stable"
tap "mvndaemon/mvnd"
tap "rockymadden/rockymadden"

mas "Xcode", id: 497799835

# Brews
brew "ansible"
brew "asciidoc"
brew "asciidoctor"
brew "asciidoctorj"
brew "autoconf"
brew "automake"
brew "awscli"
brew "bat"
brew "chruby-fish"
brew "dust"
brew "emacs"
brew "entr"
brew "exa"
brew "fish"
brew "fzf"
brew "ghostscript"
brew "git"
brew "git-delta"
brew "glow"
brew "graphviz"
brew "iftop"
brew "imagemagick"
brew "jq"
brew "librsvg"
brew "mas"
brew "maven"
brew "minikube"
brew "minio-mc"
brew "mvndaemon/mvnd/mvnd"
brew "netperf"
brew "neovim"
brew "node"
brew "npm"
brew "openjdk"
brew "python"
brew "rockymadden/rockymadden/slack-cli"
brew "ruby-install"
brew "sbt"
brew "smartmontools"
brew "starship"
brew "telnet"
brew "terraform"
brew "tig"
brew "tree"
brew "ufraw"
brew "wireshark"

# Casks
cask "affinity-designer"
cask "affinity-photo"
cask "affinity-publisher"
cask "alfred"
cask "balenaetcher"
cask "bartender"
cask "beamer"
cask "cyberduck"
cask "discord"
cask "docker"
cask "drawio"
cask "firefox"
cask "google-chrome"
cask "intellij-idea"
cask "iterm2"
cask "jellyfin"
cask "joplin"
cask "karabiner-elements"
cask "kindle"
cask "microsoft-office"
cask "microsoft-teams"
cask "lulu"
cask "ngrok"
cask "nordvpn"
cask "obs"
cask "onyx"
cask "omnigraffle"
cask "openttd"
cask "oversight"
cask "postbox"
cask "postman"
cask "remarkable"
cask "slack"
cask "spotify"
cask "steam"
cask "telegram"
cask "tor-browser"
cask "tunnelblick"
cask "vlc"
cask "vnc-viewer"
cask "whatsapp"

# Mac App Store
# Find name of an App by calling curl "http://itunes.apple.com/lookup?id=715768417" | jq -r ".results[0].trackName"
mas "Numbers", id: 409203825
mas "Airmail 3", id: 918858936
mas "Pages", id: 409201541
mas "Keynote", id: 409183694
