tap "felixkratz/formulae"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "minio/stable"
tap "mvndaemon/mvnd"
tap "oktadeveloper/tap"
tap "rockymadden/rockymadden"
brew "act"
brew "pycparser"
brew "cffi"
brew "cryptography"
brew "libyaml"
brew "tree"
brew "ansible"
brew "harfbuzz"
brew "python@3.13"
brew "antlr"
brew "jpeg-xl"
brew "aom"
brew "boost"
brew "asciidoc"
brew "asciidoctor"
brew "asciidoctorj"
brew "autoconf"
brew "automake"
brew "node"
brew "aws-cdk"
brew "awscli"
brew "libssh2"
brew "bat"
brew "bison"
brew "fish"
brew "chruby-fish"
brew "dcraw"
brew "docutils"
brew "dust"
brew "entr"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "libavif"
brew "webp"
brew "gd"
brew "gdbm"
brew "gdk-pixbuf"
brew "pango"
brew "ghostscript"
brew "git"
brew "git-delta"
brew "git-filter-repo"
brew "glow"
brew "unbound"
brew "gnutls"
brew "gobject-introspection"
brew "gradle"
brew "netpbm"
brew "gts"
brew "librsvg"
brew "graphviz"
brew "helix"
brew "iftop"
brew "shared-mime-info"
brew "libheif"
brew "imagemagick"
brew "jhipster"
brew "jq"
brew "lazygit"
brew "libffi"
brew "libraw"
brew "luv"
brew "mas"
brew "maven"
brew "minikube"
brew "minio-mc"
brew "moreutils"
brew "neovim"
brew "netperf"
brew "node@24"
brew "nvm"
brew "ollama", restart_service: :changed
brew "openblas"
brew "ripgrep"
brew "opencode"
brew "openjdk@11"
brew "podman"
brew "postgresql@18"
brew "python@3.10"
brew "python@3.11"
brew "python@3.9"
brew "tcl-tk"
brew "r"
brew "rclone"
brew "ruby-install"
brew "sbt"
brew "smartmontools"
brew "starship"
brew "telnet"
brew "tig"
brew "ufraw"
brew "uv"
brew "watch"
brew "wireshark"
brew "zoxide"
brew "felixkratz/formulae/svim"
brew "hashicorp/tap/packer"
brew "hashicorp/tap/terraform"
brew "mvndaemon/mvnd/mvnd"
cask "adobe-acrobat-reader"
cask "affinity-designer"
cask "affinity-photo"
cask "affinity-publisher"
cask "alfred"
cask "balenaetcher"
cask "beamer"
cask "claude-code"
cask "cyberduck"
cask "discord"
cask "docker-desktop"
cask "drawio"
cask "firefox"
cask "flameshot"
cask "google-chrome"
cask "intellij-idea"
cask "iterm2"
cask "jellyfin"
cask "jordanbaird-ice"
cask "karabiner-elements"
cask "kindle"
cask "librewolf"
cask "lulu"
cask "mactex"
cask "microsoft-auto-update"
cask "microsoft-office"
cask "microsoft-teams"
cask "ngrok"
cask "nordvpn"
cask "obs"
cask "oktadeveloper/tap/okta"
cask "omnigraffle"
cask "onyx"
cask "openttd"
cask "oversight"
cask "postbox"
cask "postman"
cask "remarkable"
cask "shortcat"
cask "slack"
cask "slack-cli"
cask "spotify"
cask "steam"
cask "telegram"
cask "tomatobar"
cask "tor-browser"
cask "tunnelblick"
cask "visualvm"
cask "vlc"
cask "vnc-viewer"
cask "wezterm"
cask "whatsapp"
mas "Brother P-touch Editor", id: 1453365242
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "The Unarchiver", id: 425424353
mas "Xcode", id: 497799835
